starliliko/diy-drone-powered-by-esp32s3/components/core/crazyflie/modules/src/estimator_kalman.c
      if (updateQueuedMeasurments(&gyro, osTick))
      {
        doneUpdate = true;
      }
    }

    /**
     * If an update has been made, the state is finalized:
     * - the attitude error is moved into the body attitude quaternion,
     * - the body attitude is converted into a rotation matrix for the next prediction, and
     * - correctness of the covariance matrix is ensured
     */

    if (doneUpdate)
    {
      kalmanCoreFinalize(&coreData, osTick);
      STATS_CNT_RATE_EVENT(&finalizeCounter);
      if (!kalmanSupervisorIsStateWithinBounds(&coreData))
      {
        coreData.resetEstimation = true;

        if (osTick > warningBlockTime)
        {
          warningBlockTime = osTick + WARNING_HOLD_BACK_TIME;
          ESP_LOGI("ESTKALMAN", "State out of bounds, resetting");
        }
      }
    }

    /**
     * Finally, the internal state is externalized.
     * This is done every round, since the external state includes some sensor data
     */
    xSemaphoreTake(dataMutex, portMAX_DELAY);
    kalmanCoreExternalizeState(&coreData, &taskEstimatorState, &accSnapshot, osTick);
    xSemaphoreGive(dataMutex);

    STATS_CNT_RATE_EVENT(&updateCounter);
  }
}

void estimatorKalman(state_t *state, sensorData_t *sensors, control_t *control, const uint32_t tick)
{
  // This function is called from the stabilizer loop. It is important that this call returns
  // as quickly as possible. The dataMutex must only be locked short periods by the task.
  xSemaphoreTake(dataMutex, portMAX_DELAY);

  // Average the last IMU measurements. We do this because the prediction loop is
  // slower than the IMU loop, but the IMU information is required externally at
  // a higher rate (for body rate control).
  bool accRead = sensorsReadAcc(&sensors->acc);
  bool gyroRead = sensorsReadGyro(&sensors->gyro);

  if (accRead)
  {
    accAccumulator.x += sensors->acc.x;
    accAccumulator.y += sensors->acc.y;
    accAccumulator.z += sensors->acc.z;
    accAccumulatorCount++;
    // Also feed the attitude-update accumulator (independent, not cleared by predict)
    accAttAccumulator.x += sensors->acc.x;
    accAttAccumulator.y += sensors->acc.y;
    accAttAccumulator.z += sensors->acc.z;
    accAttAccumulatorCount++;
  }

  if (gyroRead)
  {
    gyroAccumulator.x += sensors->gyro.x;
    gyroAccumulator.y += sensors->gyro.y;
    gyroAccumulator.z += sensors->gyro.z;
    gyroAccumulatorCount++;
  }

  // Average the thrust command from the last time steps, generated externally by the controller
  thrustAccumulator += control->thrust;
  thrustAccumulatorCount++;

  // Average barometer data
  if (useBaroUpdate)
  {
    bool baroRead = sensorsReadBaro(&sensors->baro);
    if (baroRead)
    {
      baroAslAccumulator += sensors->baro.asl;
      baroAccumulatorCount++;

      // // 调试：第一次和之后每100次输出一次
      // static uint32_t baroReadCount = 0;
      // if (baroReadCount == 0 || ++baroReadCount >= 100)
      // {
      //   ESP_LOGI("ESTKALMAN", "Baro read: asl=%.2f, accumCount=%lu", (double)sensors->baro.asl, baroAccumulatorCount);
      //   baroReadCount = (baroReadCount >= 100) ? 1 : 0;
      // }
    }
    else
    {
      // // 调试：如果读不到数据，每100次输出一次
      // static uint32_t baroFailCount = 0;
      // if (++baroFailCount >= 1000)
      // {
      //   ESP_LOGI("ESTKALMAN", "Baro read failed, accumCount=%lu", baroAccumulatorCount);
      //   baroFailCount = 0;
      // }
    }
  }

  // Make a copy of sensor data to be used by the task
  memcpy(&gyroSnapshot, &sensors->gyro, sizeof(gyroSnapshot));
  memcpy(&accSnapshot, &sensors->acc, sizeof(accSnapshot));

  // Copy the latest state, calculated by the task
  memcpy(state, &taskEstimatorState, sizeof(state_t));
  xSemaphoreGive(dataMutex);

  xSemaphoreGive(runTaskSemaphore);
}

static bool predictStateForward(uint32_t osTick, float dt)
{
  if (gyroAccumulatorCount == 0 || accAccumulatorCount == 0 || thrustAccumulatorCount == 0)
  {
    return false;
  }

  xSemaphoreTake(dataMutex, portMAX_DELAY);

  // gyro is in deg/sec but the estimator requires rad/sec
  Axis3f gyroAverage;
  gyroAverage.x = gyroAccumulator.x * DEG_TO_RAD / gyroAccumulatorCount;
  gyroAverage.y = gyroAccumulator.y * DEG_TO_RAD / gyroAccumulatorCount;
  gyroAverage.z = gyroAccumulator.z * DEG_TO_RAD / gyroAccumulatorCount;

  // accelerometer is in Gs but the estimator requires ms^-2
  Axis3f accAverage;
  accAverage.x = accAccumulator.x * GRAVITY_MAGNITUDE / accAccumulatorCount;
  accAverage.y = accAccumulator.y * GRAVITY_MAGNITUDE / accAccumulatorCount;
  accAverage.z = accAccumulator.z * GRAVITY_MAGNITUDE / accAccumulatorCount;

  // thrust is in grams, we need ms^-2
  float thrustAverage = thrustAccumulator * CONTROL_TO_ACC / thrustAccumulatorCount;

  accAccumulator = (Axis3f){.axis = {0}};
  accAccumulatorCount = 0;
  gyroAccumulator = (Axis3f){.axis = {0}};
  gyroAccumulatorCount = 0;
  thrustAccumulator = 0;
  thrustAccumulatorCount = 0;

  xSemaphoreGive(dataMutex);

  // TODO: Find a better check for whether the quad is flying
  // Assume that the flight begins when the thrust is large enough and for now we never stop "flying".
  if (thrustAverage > IN_FLIGHT_THRUST_THRESHOLD)
  {
    lastFlightCmd = osTick;
    if (!quadIsFlying)
    {
      takeoffTime = lastFlightCmd;
    }
  }
  quadIsFlying = (osTick - lastFlightCmd) < IN_FLIGHT_TIME_THRESHOLD;

  kalmanCorePredict(&coreData, thrustAverage, &accAverage, &gyroAverage, dt, quadIsFlying);

  return true;
}

static bool updateQueuedMeasurments(const Axis3f *gyro, const uint32_t tick)
{
  bool doneUpdate = false;
  /**
   * Sensor measurements can come in sporadically and faster than the stabilizer loop frequency,
   * we therefore consume all measurements since the last loop, rather than accumulating
   */

  tofMeasurement_t tof;
  while (stateEstimatorHasTOFPacket(&tof))
  {
    kalmanCoreUpdateWithTof(&coreData, &tof);
    doneUpdate = true;
  }

  yawErrorMeasurement_t yawError;
  while (stateEstimatorHasYawErrorPacket(&yawError))
  {
    kalmanCoreUpdateWithYawError(&coreData, &yawError);
    doneUpdate = true;
  }

